dycodex/STC3115-Arduino/src/STC3115_registers.h
#ifndef STC3115_REGISTER_H
#define STC3115_REGISTER_H

#define STC3115_REG_MODE 0x00
#define STC3115_REG_CTRL 0x01
#define STC3115_REG_SOC_L 0x02
#define STC3115_REG_SOC_H 0x03
#define STC3115_REG_COUNTER_L 0x04
#define STC3115_REG_COUNTER_H 0x05
#define STC3115_REG_CURRENT_L 0x06
#define STC3115_REG_CURRENT_H 0x07
#define STC3115_REG_VOLTAGE_L 0x08
#define STC3115_REG_VOLTAGE_H 0x09
#define STC3115_REG_TEMPERATURE 0x0A
#define STC3115_REG_CC_ADJ_HIGH 0x0B
#define STC3115_REG_VM_ADJ_HIGH 0x0C
#define STC3115_REG_OCV_L 0x0D
#define STC3115_REG_OCV_H 0x0E
#define STC3115_REG_CC_CNF_L 0x0F
#define STC3115_REG_CC_CNF_H 0x10
#define STC3115_REG_VM_CNF_L 0x11
#define STC3115_REG_VM_CNF_H 0x12
#define STC3115_REG_ALARM_SOC 0x13
#define STC3115_REG_ALARM_VOLTAGE 0x14
#define STC3115_REG_CURRENT_THRES 0x15
#define STC3115_REG_RELAX_COUNT 0x16
#define STC3115_REG_RELAX_MAX 0x17
#define STC3115_REG_ID 0x18
#define STC3115_REG_CC_ADJ_LOW 0x19
#define STC3115_REG_VM_ADJ_LOW 0x1A
#define STC3115_ACC_CC_ADJ_L 0x1B
#define STC3115_ACC_CC_ADJ_H 0x1C
#define STC3115_ACC_VM_ADJ_L 0x1D
#define STC3115_ACC_VM_ADJ_H 0x1E
#define STC3115_REG_RAM0 0x20
#define STC3115_REG_RAM1 0x21
#define STC3115_REG_RAM2 0x22
#define STC3115_REG_RAM3 0x23
#define STC3115_REG_RAM4 0x24
#define STC3115_REG_RAM5 0x25
#define STC3115_REG_RAM6 0x26
#define STC3115_REG_RAM7 0x27
#define STC3115_REG_RAM8 0x28
#define STC3115_REG_RAM9 0x29
#define STC3115_REG_RAM10 0x2A
#define STC3115_REG_RAM11 0x2B
#define STC3115_REG_RAM12 0x2C
#define STC3115_REG_RAM13 0x2D
#define STC3115_REG_RAM14 0x2E
#define STC3115_REG_RAM15 0x2F
#define STC3115_REG_OCVTAB0 0x30
#define STC3115_REG_OCVTAB1 0x31
#define STC3115_REG_OCVTAB2 0x32
#define STC3115_REG_OCVTAB3 0x33
#define STC3115_REG_OCVTAB4 0x34
#define STC3115_REG_OCVTAB5 0x35
#define STC3115_REG_OCVTAB6 0x36
#define STC3115_REG_OCVTAB7 0x37
#define STC3115_REG_OCVTAB8 0x38
#define STC3115_REG_OCVTAB9 0x39
#define STC3115_REG_OCVTAB10 0x3A
#define STC3115_REG_OCVTAB11 0x3B
#define STC3115_REG_OCVTAB12 0x3C
#define STC3115_REG_OCVTAB13 0x3D
#define STC3115_REG_OCVTAB14 0x3E
#define STC3115_REG_OCVTAB15 0x3F

#endif
